%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function obj_function=flight_range_opt_obj_function(x)
% 功率消耗最小，飞行时间最长，前飞速度最大，航程最大化
% 功率调用函数和气动力调用函数一起调用同一个函数Aero_F_M_fruitfly——程序较简洁
% morphology_para_opt_obj_function
% morphology parametric optimization objective function
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % variable=[f,phi_m,K,eta_m,C_eta,Phi_eta,eta_0,R_wingeff,C_avereff,xr,C_maxy];     % 变量
% % f∈[0,inf];  phi_m∈[0,pi/2];  K∈[0,1]; % eta_m∈[0,pi]; C_eta∈[0,inf];  Phi_eta∈[-pi,pi]; eta_0∈[eta_m-pi,pi-eta_m];
% eta_m=x(8);
% eta_0min=eta_m-pi;
% eta_0max=pi-eta_m;
% LB = [2, 0.5, 0, 0,0,0,0,0,0,-pi,eta_0min];            % Lower bound       % 单位: mm & 扭转轴距前缘的无量纲距离[0,0.5]
% UB = [4, 2, 2, 0.5,inf,pi/2,1,pi,inf,pi,eta_0max];   % Upper bound      % 单位: mm & 扭转轴距前缘的无量纲距离[0,0.5]
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 第一部分——气动功率
% 原始果蝇翅膀 R_wing=3.004;  C_aver=0.8854;   
% C_lead_ymax =0.4644;  C_trail_ymin =-0.8374;  C_max_LtoT = 1.3018; @C_maxy=0;
% Ratio_leadmax=C_lead_ymax/C_max_LtoT;
% %Ratio_leadmax=0.4644/1.3018=0.356737; %针对翅根和翅尖连线的扭转轴定出的前缘/最大前缘点和最新后缘点坐标间距=0.3567
% x=[3.004,0.8854,0.3289,0.356737]; % 初始值. % 未优化的果蝇翅膀形貌参数—翅根和翅尖连线的扭转轴定出的前缘/最大前缘点和最新后缘点坐标间距=0.3567
% C_lead_ymax =0.3255;  C_trail_ymin =-0.9764;  C_max_LtoT =1.3018;
% Ratio_leadmax=C_lead_ymax/C_max_LtoT; %Ratio_leadmax=0.3255/1.3018=0.25;%针对扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时
% x=[3.004,0.8854,0.3289,0.25]; % 初始值. % 未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时
% x=[3.004,0.8854,0.3289,0.5]; % 初始值. % 未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.5倍时
% x=[100,33.7,0.3289,0.356737];  %验证被放大后的翅膀的转动惯量——非常棒
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 变量单位: mm & 扭转轴距前缘的量纲距离[0,0.6509]——注意这里可能不用——XXX
% x=[3.004,0.8854,0.3289,0.1389];     % 未优化的果蝇翅膀形貌参数
% C_maxy25_nd=(0.464385778290230-0.138924474377504)/1.3018=0.3255/1.3018;  %C_maxy25_nd=0.25;
% x=[3.004,0.8854,0.3289,0.3255]; %翅膀被放大之前,扭转轴在翅膀最大前缘点到最小后缘点的距离1/4位置@0.25*C_max_LtoT, 见上一句指令的解释
% Ratio_leadmax=C_lead_ymax/C_max_LtoT; %Ratio_leadmax=0.4644/1.3018=0.356737; %针对翅根和翅尖连线的扭转轴定出的前缘
% x=[3.004,0.8854,0.3289,0.4644];     %翅膀被放大之前,扭转轴在翅根翅尖连线上@0.356737*C_max_LtoT, 见上一句指令的解释
% x=[3.004,0.8854,0.3289,0];          % 翅膀被放大之前,扭转轴在翅膀前缘最大值点处@0*C_max_LtoT
% x=[3.004,0.8854,0.3289,0.6509]; % 翅膀被放大之前,扭转轴在翅膀最大前缘点到最小后缘点的距离一半位置@0.5*C_max_LtoT
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 2014-Science-实验测试而得运动学数据；翅膀形貌学参数为：
% % x=[3.004,0.8854,0.3289,0.25]; %初始值. %未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时——结果
% % P_asterisk=31.8058; L=1.3940; % 未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时——结果
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%@ options = gaoptimset('InitialPopulation',x_start,'TimeLimit',14400);
% x =[3.6470,1.9176,0.6487,0.4258]; 
%@options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fminsearch,fminsearchOptions});
% x =[4.0000,1.3086,0.9363,0.4644]; 
% @options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fminsearch,fminsearchOptions});
% x =[4.0000,1.2895,0.9238,0.4644]; %ConstraintFunction=@aspectratio_constraint; 
% @options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fmincon,fminconOptions});
% x =[2.0000,1.1161,1.0711,-0.1865];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[4.0000,0.5000,1.3364,0.5000];  % 不合理
% x=[4.0000,1.4283,0.9992,0.5000];  % 不合理
% x =[4,2,0.8188,0.5];                       % L = 1.0009;
% x=[2.2899,1.0561,0.3788,0.0001];  % 20150204-Hybrid GA-Fmincon计算结果
% x =[3.1133,0.5938,0.3297,0.2450]; % 20150204-Hybrid GA-Fminsearch计算结果
% x=[2.5088,1.1424,0.7124,0.0458];   % 20150209-Hybrid GA-Fminsearch计算结果
%% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[108.5082,1.7828,3.0150,0.7854,1.0431,0.6109,0.0749]; %——20140301-hybrid_GA_fminsearch_WingM4
% output: P_asterisk =27.4317;   L =1.0000;   delta =2.7839e-005;
% x_start= [120.4862, 1.5400,2.8107,-0.7854,0.9935,0.0114,0.0381]; %——20140304-hybrid_GA_fminsearch_WingM4
% output: P_asterisk =19.4628;   L =1.0000; delta =-1.2695e-009;
% x =[3.1935,1.6054,2.1531,0.5000,1.2853,0.8770,0.6763,0.1370,1.5444,-2.0757,0.2672]; %20150315-hybrid_GA_fminsearch_WingM4_3-11变量-结果
% output: P_asterisk =13.5366;    L =0.9762;  delta =-0.0238;
% x=[3.1940,1.7834,1.9737,0.4248,2.1375,0.3594,0.7267,-0.4506,0.8049,-2.9541,0.1517];
% output: P_asterisk =3.7620;     L =0.9998;       delta =-1.9874e-004;
% x=[108.5082,1.7828,3.0150,0.7854,1.0431,0.6109,0.0749 ,2.5088,1.1424,0.7124,0.0458]; %——20140301-hybrid_GA_fminsearch_WingM4
% output: P_asterisk =6.0113;   L =0.6944   delta =-0.3056; % 采用这组数据组合得到的结果是升重比小于1
% x=[120.4862,1.5400,2.8107,-0.7854,0.9935,0.0114,0.0381,2.5088,1.1424,0.7124,0.0458];%——20140304-hybrid_GA_fminsearch_WingM4
% output: P_asterisk =3.9471;   L =0.5966 ;  delta =-0.4034; % 采用这组数据组合得到的结果是升重比小于1
% x=[2.5265,0.5467,1.2822,0.6052,1.2692,-1.0154,0.0470,2.0970,1.3003,1.9931,0.0008];
% output: P_asterisk =4.8268;      L =1.0001;      delta =6.9477e-005;
% x =[1.0944,0.7427,0.8889,0.5062,1.9926,3.5444,1.6864,2.3574,0.4257];
% output: P_asterisk =3.5631;  L =1.0007;  delta =7.1246e-004;
% x=[120.4862,1.5400,2.8107,0.9935,0.0114,2.5088,1.1424,0.7124,0.0458];
% x=[126.0625,1.3884,2.3453,0.8991,0.2622,2.9992,1.1188,0.8973,0.2395];
% output: P_asterisk =2.0616;    L =0.9999;   delta =-1.1719e-004;
% x=[129.8096,1.5350,2.3679,0.8461,-0.0488,3.1267,1.1578,0.7896,0.1624];
% output: P_asterisk =3.9132;     L =0.9999;   delta =-7.2005e-005;
% x=[188.6980,1.2630,2.6270,0.4302,1.0689,0.0852,-0.0563,2.5604,0.9805,0.8083,0.0946]; % 11个变量
% output: P_asterisk =5.7957;   L =1.0000;  delta =4.4414e-006;
% x =[189.6461,1.4858,2.7456,0.5867,1.3172,-0.0779,0.0181,2.5223,1.0679,0.7204,0.2377];
% output: P_asterisk = 9.3661 L =0.9999;  delta =-1.1967e-004;
% x=[189.0216,1.4714,2.9520,0.0080,1.3754,-0.3428,0.0222,2.4904,1.1268,0.7390,0.2835];%20150428_WingM4_4_3_11variable_group-结果
% output: P_asterisk =10.1381;     L =1.0000;         delta =2.6063e-005;
% x =[74.7130,1.4522,2.5332,0.1185,0.7491,0.0379,0.0081,3.5848,1.4845,1.9894,0.3193];%20150519-WingM4_5_11variable_group-结果
% output: P_asterisk =88.6723;     L =2.2113;  delta =1.2113;
% x=[35.4018,1.5769,-0.5250,-0.3650,0.8572,-3.1414,0.0167,3.9583,1.8190,1.9995,-0.0486]; % 11个变量
% x=[35.4018,1.5769,-0.5250,0.8572,-3.1414,0.0167,3.9583,1.8190,1.9995,-0.0486]; % 10个变量
% x =[48.9196,1.4864,2.5901,0.9381,-0.1470,-0.0008,2.7621,2.0000,1.9383,-0.0080];% 10个变量
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[45.4147,1.5696,1.8489,1.0385,-0.9685,-0.0463,3.5193,1.8689,1.3038,-0.0008];% 10个变量
% P_asterisk =6.9607;     L =1.0002;   delta =1.6715e-004;   penaltyfun1 =0.3343; 
% penaltyfun2 =4.5714;   AR =2.5807;   Re =126.7144;     penaltyfun5 =0;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x =[45.4271,1.5679,1.8515,1.0364,-0.9666,-0.0470,3.5258,1.8657,1.3081,0.0122];% 10个变量
% P_asterisk =7.0267;   L =1.0000; delta =2.6792e-005;   penaltyfun1 =0.0536;
% penaltyfun2 =0;    AR =2.5909;   Re =126.6284;    penaltyfun5 =0;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x =[38.7818,1.5259,2.6496,0.9744,-0.0440,0.0015,3.6837,1.7620,2.0000,0.0055];
% % P_asterisk =9.3866;   L =1.0000;    delta =-3.3726e-005;   penaltyfun1 =0.0675;   
% % penaltyfun2 =0;      AR =3.2257;   Re =103.8108;        penaltyfun5 =0;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% (1) 小尺度的FWMAV%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=80*10^(-6); 
% m_FWMAV=200*10^(-6); 
% m_FWMAV=115*10^(-6); % 80mg裸机含负载35mg; % f=100; % Hz
% m_FWMAV=380*10^(-6); % 265mg裸机含负载115mg; % f=70; % Hz
% % % Power consumption (during hover) 19mW——2013-Science-RJ Wood
% % % P_robee_asterisk=19*10^-3/(80*10^-6);   % W.kg^-1  P_robee_asterisk =237.5000;
% % f=70.55; 
% % f=111.6;   
% f=120;
% phi_m=55*pi/180;  % phi_m=0.9599;    
% K=0.0001;
% eta_m=45*pi/180;  % eta_m=0.7854;% eta_m=1.0157;  
% C_eta=2.375; 
% Phi_eta=-pi/2; % Phi_eta=-1.5708;
%% (one) %%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=115*10^(-6); % 80mg裸机含负载35mg; 
% f=100; % Hz
% R_wingeff=11.95;         % R_wingeff=3.004;  % mm
% C_avereff=3.46;            % C_avereff=0.8854; % mm
% xr=3.05;                       % xr=0.3289;           % mm
% C_maxy=0.356737;       % 无量纲
%%%%%%%%%%%%%%%%%%%%%%%%%
%%% 计算结果
% t_flight =313.4326 s (5.22 min); V_flight =1.4399 m/s; Distance_flight_min0 =451.3105 m; 
% L =1.3985; delta =0.3985; P_asterisk =79.7620; AR =4.3353; Re =1.0727e+003;
%% (two) %%%%%%%%%%%%%%%%%%%%%%%
% % m_FWMAV=380*10^(-6); % 265mg裸机含负载115mg;
% m_FWMAV=657*10^(-6);
% f=70; % Hz
% R_wingeff=11.95*1.7;         % R_wingeff=20.3150;  % mm
% C_avereff=3.46*1.7;            % C_avereff=5.8820; % mm
% xr=3.05*1.7;                       % xr=5.1850;           % mm
% C_maxy=0.356737;            % 无量纲
%%%%%%%%%%%%%%%%%%%%%%%%%
%%% 计算结果 % m_FWMAV=380*10^(-6);
% t_flight =212.2868 s (3.54 min); V_flight =1.7135 m/s; Distance_flight_min0 =363.7485 m; 
% L =1.7321; delta =0.7321; P_asterisk =117.7652; AR = 4.3353; Re =2.1701e+003;
%%% 计算结果 % m_FWMAV=657*10^(-6);
% t_flight =367.0327 s (6.1172 min) ; V_flight=1.7135; Distance_flight_min0=628.9020 m;
% L =1.0018; delta =0.0018; P_asterisk =68.1138; AR =4.3353; Re =2.1701e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  x=[f,phi_m,K,eta_m,C_eta,Phi_eta,R_wingeff,C_avereff,xr,C_maxy];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 下面是计算结果——注意对应不同的频率哦
%%%%%%%%%%%%%%%%%%%%%%%%%
% While m_FWMAV=200*10^(-6); @ f=111.6;   phi_m=55*pi/180;   
% t_flight =392.1785 s;  V_flight =1.6069 m/s; Distance_flight_min0 =630.2012 m; 
% L =1.0015; P_asterisk =63.7465; AR =4.3353; Re =1.1971e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%
% % m_FWMAV=80*10^(-6); @  f=70.55; 
% t_flight =620.9337 s; V_flight =1.0158 m/s; Distance_flight_min0 =630.7737 m; 
% L = 1.0006;delta =6.1017e-004; P_asterisk =40.2619; AR =4.3353; Re = 756.7969;
%%%%%%%%%%%%%%%%%%%%%%%%%
% % m_FWMAV=80*10^(-6);  @ f=111.6;  
% t_flight =156.8714 s; V_flight =1.6069 m/s; Distance_flight_min0 =252.0805 m;  
% L =2.5038; delta =1.5038; P_asterisk =159.3662;  AR =4.3353; Re =1.1971e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%
% % m_FWMAV=80*10^(-6);  @ f=120; 
% t_flight = 126.1806 s; V_flight = 1.7279 m/s; Distance_flight_min0=218.0244 m;
% L=2.8949;  delta=1.8949; P_asterisk=198.1287; AR=4.3353; Re=1.2873e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% (2) 较大点的FWMAV%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=4000*10^(-6);
% % % Power consumption (during hover) xxx mW——2015-IEEE TR-Hines and M Sitti
% % % P_robee_asterisk=xxx*10^-3/(4000*10^-6);   % W.kg^-1  P_robee_asterisk =xxx;
% f=12;                      
% phi_m=57.5*pi/180;  
% K=0.0001;
% eta_m=45*pi/180;   % eta_m=1.0157;  
% C_eta=2.375; 
% Phi_eta=-pi/2;  
% %%%%%%%%%%%%%%%%%%%%%%%%%%%
% R_wingeff=70;          % R_wingeff=90; % mm
% C_avereff=29.31;       % C_avereff=45;  % mm  % C_avereff=35; 
% xr=15;                     % xr=45;  % mm
% C_maxy=0.356737;   % 无量纲
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[f,phi_m,K,eta_m,C_eta,Phi_eta,R_wingeff,C_avereff,xr,C_maxy];  % x=[12,57.5*pi/180,0.0001,45*pi/180,2.357,-pi/2,70,29.31,15,0.356737];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%
% While f=12;  phi_m=57.5*pi/180;
% t_flight = 615.1234 s (10.25 min); V_flight =1.0236 m/s; Distance_flight_min0 =629.6622m;  
% L =1.0078; P_asterisk =40.6423; AR =2.9000; Re =6.6779e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% (3) 较大点的仿蜂鸟FWMAV%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
m_FWMAV=17.5*10^(-3);
% % % Power consumption (during hover) xxx mW——2015-IEEE TR-Hines and M Sitti
% % % P_robee_asterisk=xxx*10^-3/(4000*10^-6);   % W.kg^-1  P_robee_asterisk =xxx;
f=27.5;                      
phi_m=90*pi/180;  
K=0.0001;
eta_m=45*pi/180;   % eta_m=1.0157;  
C_eta=3.75;                  % C_eta=2.375; 
Phi_eta=-pi/2;  
% %%%%%%%%%%%%%%%%%%%%%%%%%%%
R_wingeff=68;          % R_wingeff=90; % mm
C_avereff=26;       % C_avereff=45;  % mm  % C_avereff=35; 
xr=0;                   % xr=15;   % xr=45;  % mm
C_maxy=0.356737;   % 无量纲
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
x=[f,phi_m,K,eta_m,C_eta,Phi_eta,R_wingeff,C_avereff,xr,C_maxy];  % x=[12,57.5*pi/180,0.0001,45*pi/180,2.357,-pi/2,70,29.31,15,0.356737];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%
% While f=12;  phi_m=57.5*pi/180;
% t_flight = 615.1234 s (10.25 min); V_flight =1.0236 m/s; Distance_flight_min0 =629.6622m;  
% L =1.0078; P_asterisk =40.6423; AR =2.9000; Re =6.6779e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%


%% 组合优化的结果
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% for m_FWMAV=80*10^(-6); %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=80*10^(-6); 
% x =[15.7975,1.2896,0.5016,1.0875,4.7362,-1.562,15.5081,7.7486,9.9626,0.0151];
% t_flight =2.6116e+003 s (43.5 min); V_flight =0.5189 m/s; Distance_flight_min0 =1.3551e+003 m; 
% L =1.0000; delta =4.5937e-005; P_asterisk =9.5728; AR =3.2871; Re =661.6246;
%%%下面是精确值
% m_FWMAV=80*10^(-6); 
% x =[1.5797463e+001,1.2895694e+0,5.0159467e-001,1.0875403e+0,4.7362130e+0, -1.5620049e+0,1.5508054e+001,7.7486129e+0,9.9626168e+0,1.5053229e-002];
% t_flight =2.6121e+003 s (43.5 min); V_flight =0.5189 m/s; Distance_flight_min0 =1.3554e+003 m;
% L =1.0000; delta =-4.7216e-008; P_asterisk =9.5709; AR =3.2871; Re =661.6246;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% for m_FWMAV=200*10^(-6); %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=200*10^(-6); 
% x =[16.9128,1.242,0.1083,0.8213,4.7407,-1.4121,19.0364,9.0774,12.6923,0.0047];
% t_flight =1.0228e+003 s (17 min); V_flight =0.6665 m/s; Distance_flight_min0 =681.6856 m;
% L =0.9999; delta =-5.9575e-005; P_asterisk =24.4425;  AR =3.4953; Re =981.0652;
%%%下面是精确值
% m_FWMAV=200*10^(-6); 
% x=[1.6912828e+001,1.2420390e+000,1.0834365e-001,8.2130076e-001,4.7406786e+000,-1.4120757e+000,1.9036443e+001,9.0774180e+000,1.2692286e+001,4.7016471e-003];
% t_flight =1.0227e+003 s (17 min); V_flight =0.6665 m/s; Distance_flight_min0 =681.6380 m;
% L =1.0000; delta =6.6878e-008; P_asterisk =24.4450; AR =3.4953; Re =981.0652;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% for m_FWMAV=4000*10^(-6); %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_FWMAV=4000*10^(-6);
% x =[12.8772,1.0664,0.0353,1.3488,0.3911,-1.5705,69.7031,28.6843,14.5563,0.1250];
% t_flight =1.1858e+003 s (19.8 min); V_flight =1.1571 m/s; Distance_flight_min0 =1.3721e+003 m;
% L =0.9999; delta =-7.0074e-005; P_asterisk =21.0829; AR =2.9375;  Re =7.4208e+003;
%%%下面是精确值
% m_FWMAV=4000*10^(-6);
% x =[1.2877231e+001  1.0664349e+000  3.5329395e-002  1.3488149e+000  3.9109866e-001 -1.5704619e+000  6.9703094e+001  2.8684309e+001  1.4556300e+001  1.2495568e-001];
% t_flight =1.1856e+003 s (19.8 min); V_flight =1.1571 m/s; Distance_flight_min0 =1.3719e+003 m;
% L =1.0000; delta =2.2206e-010; P_asterisk =21.0855; AR =2.9375; Re =7.4208e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% m_FWMAV=17.5*10^(-3); %% (3) 较大点的仿蜂鸟FWMAV
% P_total_aver =2.4842e+006 uW (2.484W);  t_flight =684.7293 s (11.4122 min);  V_flight =2.9374 m/s; 
% Distance_flight_min0 =2.0113e+003;  Distance_flight_min =4.9719e-004;
% L = 1.3360; delta =0.3360;  P_asterisk =141.9539; AR =2.6154; Re =2.0641e+004;
% penaltyfun1 =672.0668; penaltyfun2 =414.7254; penaltyfun5 = 2000; obj_function =3.0868e+003;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[3.004,0.8854,0.3289,0.356737];
% % 下面的数据是实测原始翅膀形貌和翅膀运动计算而得
% % 升阻比、功率比、功率密度以及升重比、展弦比和雷诺数。
% Rario_F_vertical_horiz_aver =1.3142;    % 升推比
% F_vertical_to_horiz_rms =0.8448;          % 升推比rms
% P_aero_aver_to_inertia_aver =13.5511; % 全正气动功率与全正惯性功率的比值
% P_asterisk =22.3727;  % 功率密度
% L =1.3319;                  % 升重比
% AR =3.7643;               % 展弦比
% Re =155.8311;           % 雷诺数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% tic
Force_Power=Aero_F_M_fruitfly(x); % 调用函数: 求垂直方向的平均力和翅运动平均正功率
% Force_Power=Aero_F_M_fruitfly();      % 调用函数: 求垂直方向的平均力和翅运动平均正功率
F_vertical_aver=2*Force_Power(1);     % 两个翅膀——垂直方向的平均力: uN
P_total_aver=2*Force_Power(2)         % 两个翅膀——分别两个自由度翅运动产生的正功率: uW
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% m_insect=1.8;     % M_fly=1.8mg;  % 2014-Science-MH Dickinson     % P_asterisk =31.8058; % 量纲单位=uW/mg;
% m_insect=0.72;    % 0.72 mg  % 2007-JFM-Wang ZJ                           % P_asterisk =80.6538; % 量纲单位=uW/mg;
% m_insect=0.96;    % 0.96 mg  % 2005-JEB-MH Dickinson                    % P_asterisk =60.4903; % 量纲单位=uW/mg;
% m_insect=1.05;    % 1.05mg; % 1997-JEB-Fritz-Olaf lehmann              % P_asterisk =55.3054; % 量纲单位=uW/mg;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x是变量variable=[R_wingeff,C_avereff,xr,C_maxy]; 
% P_total_aver=Aero_F_M_fruitfly(x);  %调用函数: 正功率——平动功率和扭转功率——扭转轴功率和拍打轴功率
% P_asterisk=P_total_aver/m_insect;       % 功率密度——量纲单位=uW/mg;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 第二部分——penaltyfun1——升重比约束——惩罚函数
% % x=[3.004,0.8854,0.3289,0.4644];  % 未优化的果蝇翅膀形貌参数——翅根和翅尖连线的扭转轴定出的前缘
% x=[3.004,0.8854,0.3289,0.356737]; % 初始值. % 未优化的果蝇翅膀形貌参数—翅根和翅尖连线的扭转轴定出的前缘/最大前缘点和最新后缘点坐标间距=0.3567
% % x=[3.004,0.8854,0.3289,0.1389];  % 未优化的果蝇翅膀形貌参数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 2014-Science-实验测试而得运动学数据；翅膀形貌学参数为：
% % x=[3.004,0.8854,0.3289,0.25]; %初始值. %未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时——结果
% % P_asterisk=31.8058; L=1.3940; % 未优化的果蝇翅膀形貌参数—扭转轴位于最大前缘点和最新后缘点坐标间距0.25倍时——结果
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% @ options = gaoptimset('InitialPopulation',x_start,'TimeLimit',14400);
% x =[3.6470,1.9176,0.6487,0.4258]; 
%@options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fminsearch,fminsearchOptions});
% x =[4.0000,1.3086,0.9363,0.4644]; 
% @options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fminsearch,fminsearchOptions});
% x =[4.0000,1.2895,0.9238,0.4644]; %ConstraintFunction=@aspectratio_constraint;  
% @options=gaoptimset('InitialPopulation',x_start,'TimeLimit',14400,'HybridFcn',{@fmincon,fminconOptions});
% x =[2.0000,1.1161,1.0711,-0.1865];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[4.0000,0.5000,1.3364,0.5000];  % 不合理
% x=[4.0000,1.4283,0.9992,0.5000];  % L =-2.6131;  % 不合理
% x =[4,2,0.8188,0.5];                       % L = 1.0009;
% x=[2.2899,1.0561,0.3788,0.0001];  % 20150204-Hybrid GA-Fmincon计算结果
% x =[3.1133,0.5938,0.3297,0.2450]; % 20150204-Hybrid GA-Fminsearch计算结果
% x=[2.5088,1.1424,0.7124,0.0458];   % 20150209-Hybrid GA-Fminsearch计算结果
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%
% 假设预设计的FWMAV的总质量为200mg; 
% m_FWMAV=80*10^(-6);     % kg     % 小尺度的FWMAV
% m_FWMAV=4000*10^(-6);   % kg    % 较大点的FWMAV
% m_battery=0.5*m_FWMAV;    % 电池的质量100mg, ——压电驱动FWMAV
m_battery=0.27*m_FWMAV;      % 电池的质量100mg, ——土星蜂鸟
S_b=500*10^3;                       % J/kg     % 电池能量密度为S_b=500kJ/kg=500*10^3/10^6=0.5J/mg=500*10^3J/kg
% eta=0.1;                               % 机电转换效率——针对压电驱动器
eta=0.72;                                 % 机电转换效率——针对微马达
t_flight=S_b*m_battery*eta/(P_total_aver*10^(-6))   % s  % 功率消耗最小，飞行时间最长，前飞速度最大，航程最大化
J=0.25;                                  % advanced ratio: J∈[0,0.5];
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
f=x(1);    % T=1/f;          % Hz
phi_m=x(2);
% epsilon=x(3);
% psi_m=x(4);
% zeta=x(5);
% psi_0=x(6);
% %%%%%%%%%%%%%%%%%%
R_wing=x(7);
% C_aver=x(8);
xr0=x(9);
% C_maxyaxis=x(10);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
R=(R_wing+xr0)*10^-3;  % m
PHI=2*phi_m;
V_flight=J*2*PHI*f*R        % m/s
Distance_flight_min0=V_flight*t_flight
Distance_flight_min=1/(V_flight*t_flight)  % m  % 功率消耗最小，飞行时间最长，前飞速度最大，航程最大化
%% 下面是约束%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
g=9.81;   % N*kg^-1=10^6/10^6=uN/mg
% m_insect=1.8;   % mg
m_insect=m_FWMAV*10^(6);  % mg
M_insectweight=m_insect*g;                  % M_weight=10.3±1.27uN@1997-JEB-Fritz-Olaf lehmann
% L会改变,因为扭转轴的位置为改变转动虚质量力系数I6z的大小;
% 此外还会引起阻尼力矩系数(Z_rnd,M_xrdcoeff)和虚质量力矩系数(I_xzam,I_xxam)的变化;
% x是变量variable=[R_wingeff,C_avereff,xr,C_maxy]; % F_verticalaver=12.3074uN; 
% F_vertical_aver=Aero_F_M_fruitfly(x); %调用函数:
% F_verticalaver=trapz(t,F_vertical)/(3*T);
L=F_vertical_aver/M_insectweight     % 升重比——无量纲: L =1.3940; 
delta=L-1                                        % delta =-1.0332e-004;
P_asterisk=P_total_aver/m_insect
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 构建惩罚函数——penaltyfun1
r=2000;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
if (L-1)<2.9999*10^(-15)&&(L-1)>0
    penaltyfun1=0;
% elseif L<0 
%     penaltyfun1=r*abs((L-1));
elseif (L-1)>=2.9999*10^(-15)||(L-1)<=0
    penaltyfun1=r*abs((L-1))
else
    disp('垂直方向力有错');
end
% toc
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % 该方案不可行的哦
% if ((L-1)>(2.9*10^(-15)) || (L-1)<0)
%     penaltyfun1=r*(L-1);    % penaltyfun1 =-1.6561e+004; 
% else
%    penaltyfun1=0;
% end
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% penaltyfun1=r*heaviside(1-L);        % heaviside(x) has the value 0 for x < 0;         1 for x > 0;       and 0.5 for x = 0.
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%% 第三部分——penaltyfun2——优化参数变量的上下界约束——惩罚函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% x=[4.0000,0.5000,1.3364,0.5000];  % 不合理
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
fcn_con=sum_constraint(x);
% 构建惩罚函数——penaltyfun2
s=2000;
penaltyfun2=s*fcn_con  % penaltyfun2 =663.6000;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% 第四部分——penaltyfun3——展弦比约束或者Rossby数约束——惩罚函数
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% penaltyfun3=aspectratio_constraint(x);  % 展弦比约束(即Rossby值约束)
% penaltyfun4=AR_Re_constraint(x);                % Re值约束
% obj_function=P_asterisk+penaltyfun1+penaltyfun2+penaltyfun3+penaltyfun4;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% obj_function=P_asterisk+penaltyfun1+penaltyfun2;
penaltyfun5=AR_Re_constraint(x)         % 展弦比约束(即Rossby值约束) 和 Re数约束
obj_function=Distance_flight_min+penaltyfun1+penaltyfun2+penaltyfun5
% toc
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%